Repository: shemetovElisey/WhiteNoise
Catalog: WhiteNoise/Resources/*.lproj/Localizable.strings
Languages: ru

# app_started
source: Application started
ru: Приложение запущено

# app_initialization_completed
source: Application initialization completed
ru: Инициализация приложения завершена

# app_terminating
source: Application terminating
ru: Приложение завершается

# global_monitor_removed
source: Global monitor removed on termination
ru: Глобальный мониторинг удален при завершении

# carbon_hotkey_removed
source: Carbon Hot Key removed on termination
ru: Carbon Hot Key удален при завершении

source: Notification permissions granted
ru: Разрешения на уведомления получены

source: Notification permissions denied: %@
ru: Разрешения на уведомления не получены: %@

source: unknown error
ru: неизвестная ошибка

source: Stop Recording
ru: Остановить запись

source: Start Recording
ru: Начать запись

source: Paste from Clipboard
ru: Вставить из буфера обмена

source: Settings
ru: Настройки

source: Quit
ru: Выход

source: Registering shortcuts...
ru: Регистрация шорткатов...

# global_shortcut_registered
source: Global shortcut Cmd+Shift+V registered successfully
ru: Глобальный шорткат Cmd+Shift+V зарегистрирован успешно

# global_monitor_unavailable
source: Global monitor unavailable (sandbox restrictions)
ru: Глобальный мониторинг недоступен (sandbox ограничения)

# shortcuts_registered
source: Shortcuts registered. Use the status bar menu as an alternative.
ru: Шорткаты зарегистрированы. Используйте меню в строке состояния как альтернативу.

# local_shortcut_registered
source: Local shortcut Cmd+Shift+V registered
ru: Локальный шорткат Cmd+Shift+V зарегистрирован

source: Microphone access granted
ru: Доступ к микрофону разрешён

source: Microphone access denied
ru: Доступ к микрофону запрещён

# before_creating_audiorecorder
source: Before creating AVAudioRecorder
ru: Перед созданием AVAudioRecorder

# audiorecorder_created
source: AVAudioRecorder created: %@
ru: AVAudioRecorder создан: %@

# after_record_call
source: After record() call, started: %@
ru: После вызова record(), started: %@

# audiorecorder_failed
source: AVAudioRecorder failed to start recording. isRecording: %@
ru: AVAudioRecorder не смог начать запись. isRecording: %@

# audiorecorder_error
source: Error creating AVAudioRecorder: %@
ru: Ошибка создания AVAudioRecorder: %@

source: Voice Input Settings
ru: Настройки Voice Input

source: Current Model
ru: Текущая модель

source: No models installed
ru: Нет установленных моделей

source: Download Model
ru: Загрузить модель

source: Change
ru: Изменить

source: Model Status
ru: Статус модели

source: Model available
ru: Модель доступна

source: Model unavailable
ru: Модель недоступна

# ensure_whisper_cli_installed
source: Make sure whisper-cli and the selected model are installed
ru: Убедитесь, что whisper-cli и выбранная модель установлены

source: Downloading Model
ru: Загрузка модели

source: Error: %@
ru: Ошибка: %@

source: Instructions
ru: Инструкции

# instruction_1
source: • Press Cmd+Shift+V to start recording
ru: • Нажмите Cmd+Shift+V для начала записи

# instruction_2
source: • Speak clearly into the microphone
ru: • Говорите четко в микрофон

# instruction_3
source: • Press Cmd+Shift+V again to stop
ru: • Нажмите Cmd+Shift+V снова для остановки

# instruction_4
source: • Recognized text will be copied to clipboard — paste it manually (Cmd+V)
ru: • Распознанный текст будет скопирован в буфер обмена — вставьте его вручную (Cmd+V)

source: System Logs
ru: Системные логи

# view_export_logs
source: View and export system logs for troubleshooting
ru: Просматривайте и экспортируйте системные логи для диагностики проблем

source: Open Logs
ru: Открыть логи

source: About App
ru: О приложении

# app_description
source: Speech recognition application
ru: Приложение для распознавания речи

source: Used Libraries:
ru: Используемые библиотеки:

# library_swiftwhisper
source: • SwiftWhisper - speech recognition
ru: • SwiftWhisper - распознавание речи

# library_whisper_cpp
source: • whisper.cpp - base library
ru: • whisper.cpp - базовая библиотека

# library_openai_whisper
source: • OpenAI Whisper - ML models
ru: • OpenAI Whisper - модели ML

source: License: MIT
ru: Лицензия: MIT

source: Logs
ru: Логи

source: Export Logs
ru: Экспорт логов

source: Clear Logs
ru: Очистить логи

# no_logs_available
source: Logs unavailable
ru: Логи недоступны

# logs_exported
source: Logs exported to: %@
ru: Логи экспортированы в: %@

# export_failed
source: Log export failed: %@
ru: Ошибка экспорта логов: %@

# clear_logs_confirmation
source: Are you sure you want to clear all logs?
ru: Вы уверены, что хотите очистить все логи?

source: Clear
ru: Очистить

source: Cancel
ru: Отмена

# model_size
source: Size: %@
ru: Размер: %@

# model_downloading
source: Downloading...
ru: Загрузка...

# model_download_complete
source: Download complete
ru: Загрузка завершена

# model_download_failed
source: Download failed
ru: Ошибка загрузки

# model_installing
source: Installing...
ru: Установка...

# model_install_complete
source: Installation complete
ru: Установка завершена

# model_install_failed
source: Installation failed
ru: Ошибка установки

source: Speech recognition started
ru: Распознавание речи началось

source: Speech recognition completed
ru: Распознавание речи завершено

source: Speech recognition failed: %@
ru: Ошибка распознавания речи: %@

source: Text copied to clipboard
ru: Текст скопирован в буфер обмена

source: Recording started
ru: Запись началась

source: Recording stopped
ru: Запись остановлена

source: Recording error: %@
ru: Ошибка записи: %@

# audio_session_error
source: Audio session setup error: %@
ru: Ошибка настройки аудио сессии: %@

# permission_denied
source: Microphone access denied
ru: Доступ к микрофону запрещен

# recording_in_progress
source: Recording already in progress
ru: Запись уже идет

source: No recording in progress
ru: Запись не идет
